<?php

    $g_lang["title_notg"] = "Поиск кратчайшего пути на графе";
    $g_lang["text"] = "<p>Визуализация графа и поиск кратчайшего пути</p>\n";
    $g_lang["add_node"] = "Добавить вершину";
    $g_lang["connect_nodes"] = "Соединить вершины";
    $g_lang["delete"] = "Удалить";
    $g_lang["default"] = "Перемещение";
    $g_lang["short_path"] = "Найти кратчайший путь";
    $g_lang["save_direction_choose"] = "Сохранить тип дуги (направленная или нет)";
    $g_lang["edge_weight"] = "Вес дуги";
    $g_lang["save_weight_choose"] = "использовать значение для следующих дуг";
    $g_lang["default_weight"] = "не нагруженный";
    $g_lang["browser_no_support"] = "Ваш браузер не поддерживается. Попробуйте обновить ваш браузер до последней версии.";
    $g_lang["select_and_move_objects"] = "Выделите и перемещайте объекты";
    $g_lang["move_cursor_for_moving"] = "Перемещайте курсор для перемещения объекта";
    $g_lang["add_graph"] = "Добавить ребро";
    $g_lang["orint_edge"] = "Ориентированную";
    $g_lang["not_orint_edge"] = "Неориентированную";
    $g_lang["show_adjacency_matrix"] = "Матрица смежности";
    $g_lang["save"] = "Сохранить";
    $g_lang["cancel"] = "Отмена";
    $g_lang["adjacency_matrix_description"] = "Задайте матрицу смежности. Используйте запятую \",\" в качестве разделителя";
    $g_lang["adjacency_matrix_bad_format"]  = "Мартрица имеет неправильный формат. Используйте запятую \",\" в качестве разделителя. Матрица должна иметь одинаковое количетво столбцов и строк.";

    $g_lang["m_title"] = "Поиск кратчайшего пути онлайн";
    $g_lang["m_keyWords"] = "поиск кратчайшего пути, визуализация графа, матрица смежности";
    $g_lang["m_description"] = "Поиск кратчайшего пути на графе";
?>