<?php

    $g_lang['m_title'] = '404 Страница не найдена';
    $g_lang['head']    = 'Страница не найдена';
    $g_lang['message'] = '<p>Извините, но мы не смогли найти страницу на нашем сервере.</p>
                          <p>Возможно вам помогут варианты:</p>
                          <ul>
                              <li>Перейти на <a href="' . SiteRoot() . '" title="Начать с главной страницы сайта">главную страницу сайта</a></li>
                              <li>Вернуться на <a href="javascript:history.back()" title="Вернуться назад">предыдущую страницу</a></li>
                          </ul>';
?>