<?php

    $g_lang['m_title'] = '500 Внутреняя ошибка сервера';
    $g_lang['head']    = 'Произошла ошибка';
    $g_lang['message'] = '<p>К сожалению, произошел сбой в работе сайта.</p>
                          <p>Возможно вам помогут варианты:</p>
                          <ul>
                              <li>Перейти на <a href="' . SiteRoot() . '" title="Начать с главной страницы сайта">главную страницу сайта</a></li>
                              <li>Вернуться на <a href="javascript:history.back()" title="Вернуться назад">предыдущую страницу</a></li>
                          </ul>';
?>