<?php

    $g_lang["title_notg"] = "Работа с графами онлайн";
    $g_lang["text"] = "<p>Проект&nbsp;<a href=\"http://graph.unick-soft.ru\">Граф&nbsp;Онлайн</a> является&nbsp;потомком программы для работы с графами <a href=\"http://grafoanalizator.unick-soft.ru\">Графоанализатор</a>. В нашем проекте мы&nbsp;постараемся&nbsp;учесть все накопившиеся за&nbsp;многие&nbsp;годы&nbsp;пожелания пользователей&nbsp;программы.</p>\n\n<p>Наш сервис позволит вам работать с графами&nbsp;непосредственно в окне вашего&nbsp;браузера. Вам необходимо&nbsp;перейти на&nbsp;главную страницу&nbsp;сайта и вы&nbsp;можете начать стоить граф <a href=\"http://graph.unick-soft.ru\">http://graph.unick-soft.ru</a>.</p>\n\n<p>Проект&nbsp;предоставяет пользователям&nbsp;решение 3 задач при работе с графами:&nbsp;</p>\n\n<ol>\n	<li>Построение графа: визуально или по матрице смежности.</li>\n	<li>Визуализация графа.</li>\n	<li>Расчет&nbsp;алгоритмов, например поиск&nbsp;кратчайшего&nbsp;пути.</li>\n</ol>\n\n<p><span style=\"background-color:rgb(255, 255, 255); font-size:15.1999998092651px\">Все вопросы и предложения вы можете присылать по адресу admin@unick-soft.ru или soft_support@list.ru</span></p>\n\n<p>&nbsp;</p>\n";

    $g_lang["m_title"] = "Граф онлайн - легкий инструмент для работы с графами";
    $g_lang["m_keyWords"] = "граф, построение графа, матрица смежности, поиск кратчайшего пути";
    $g_lang["m_description"] = "О проекте Граф Онлайн";
?>