<?php

    $g_lang["head_no_tags"] = "Построить граф по матрице инцидентности";
    $g_lang["m_keyWords"] = "матрица инцидентности, граф, создание графа, построение графа онлайн, использовать матрицу инцидентности";
    $g_lang["m_description"] = "Онлайн-инструмент для создания, построения и визуализации графа по матрице инцидентности.";
    $g_lang["m_title"] = "Построить граф по матрице инцидентности";
    $g_lang["m_description_long"] = "Поддержка создания, построения и визуализации графов по заданной матрице инцидентности. Удобный онлайн-инструмент для студентов, преподавателей и специалистов.";

    $g_lang["text"] = "<p>На данной странице вы можете построить и визуализировать граф по заданной матрице инцидентности.</p>\n";
    $g_lang["incidence_matrix_description"] = "Задайте матрицу инцидентности. Используйте запятую \",\" в качестве разделителя. Затем нажмите кнопку \"Построить граф\".";
    $g_lang["incidence_matrix_bad_format"] = "Матрица имеет неправильный формат. Используйте запятую \",\" в качестве разделителя.";
    $g_lang["plot_graph_button"] = "Построить граф";

    $g_lang["incidence_matrix_description_matrix"] = "Задайте матрицу инцидентности. Затем нажмите кнопку \"Построить граф\".";
    $g_lang["matrix_matrix_input"] = "Ввести в таблицу";
    $g_lang["text_matrix_input"] = "Ввести как текст";
    $g_lang["add_edge_to_matrix"] = "Добавить дугу";
    $g_lang["add_node_to_matrix"] = "Добавить вершину";
    
    $g_lang["use_ctrl_to_move_cells"] = "Используйте Ctrl + &#8592; &#8593; &#8594; &#8595; клавиши для перемещения между ячейками.";
?>