<?php

    $g_lang["head_no_tags"] = "Построить граф по матрице смежности";
    $g_lang["m_title"] = "Построить граф по матрице смежности онлайн";
    $g_lang["m_keyWords"] = "граф, матрица смежности, построение графа, создание графа, визуализация графа, граф онлайн, построить граф по матрице, отобразить матрицу смежности";
    $g_lang["m_description"] = "Онлайн-инструмент для создания, построения и визуализации графа по матрице смежности.";
    $g_lang["m_description_long"] = "Поддержка создания, построения и визуализации графов по заданной матрице смежности. Удобный онлайн-инструмент для студентов, преподавателей и специалистов.";

    $g_lang["text"] = "<p>На этой странице вы можете задать матрицу смежности&nbsp;и построить по ней граф&nbsp;</p>\n";
    $g_lang["adjacency_matrix_description"] = "Задайте матрицу смежности. Используйте запятую &quot;,&quot; в качестве разделителя. Затем нажмите кнопку &quot;Построить граф&quot;.&nbsp;";

    $g_lang["adjacency_matrix_bad_format"] = "Матрица имеет неправильный формат. Используйте запятую \",\" в качестве разделителя. Матрица должна иметь одинаковое количество столбцов и строк";
    $g_lang["plot_graph_button"] = "Построить граф";
    
    $g_lang["matrix_matrix_input"] = "Ввести в таблицу";
    $g_lang["text_matrix_input"] = "Ввести как текст";
    $g_lang["adjacency_matrix_description_matrix"] = "Задайте матрицу смежности. Затем нажмите кнопку &quot;Построить граф&quot;.&nbsp;";
    $g_lang["add_node_to_matrix"] = "Добавить вершину в матрицу";
    
    $g_lang["current_language"] = "ru";
    
    $g_lang["separator"] = "Разделитель: ";
    $g_lang["separator_commo"] = "запятая";
    $g_lang["separator_space"] = "пробел";
    
    $g_lang["use_ctrl_to_move_cells"] = "Используйте Ctrl + &#8592; &#8593; &#8594; &#8595; клавиши для перемещения между ячейками.";
?>
