<?php

    $g_lang["head_no_tags"] = "Построение графа по матрице инцидентности";
    $g_lang["text"] = "<p>На данной странице вы можете задать матрицу инцидентности и построить по ней граф</p>\n";
    $g_lang["incidence_matrix_description"] = "Задайте матрицу инцидентности. Используйте запятую \",\" в качестве разделителя. Затем нажмите кнопку \"Построить граф\".";
    $g_lang["incidence_matrix_bad_format"] = "Матрица имеет неправильный формат. Используйте запятую \",\" в качестве разделителя.";
    $g_lang["plot_graph_button"] = "Построить граф";

    $g_lang["m_title"] = "Построение графа по матрице инцидентности";
    $g_lang["m_keyWords"] = "матрица инцидентности, граф, создание графа, построение графа онлайн, использовать матрицу инцидентности";
    $g_lang["m_description"] = "Создание графа по матрице инцидентности онлайн";
    
    $g_lang["incidence_matrix_description_matrix"] = "Задайте матрицу инцидентности. Затем нажмите кнопку \"Построить граф\".";
    $g_lang["matrix_matrix_input"] = "Ввести в таблицу";
    $g_lang["text_matrix_input"] = "Ввести как текст";
    $g_lang["add_edge_to_matrix"] = "Добавить дугу";
    $g_lang["add_node_to_matrix"] = "Добавить вершину";
    
    $g_lang["use_ctrl_to_move_cells"] = "Используйте Ctrl + &#8592; &#8593; &#8594; &#8595; клавиши для перемещения между ячейками.";
?>