<?php

    $g_lang["head_no_tags"] = "Как создать граф по матрице смежности";
    $g_lang["text"] = "<p>Если у вас возникли сложности с созданием графа по матрице смежности с помощью нашего сервиса, то посмотрите обучающее видео</p>\n\n<p><iframe allowfullscreen=\"\" frameborder=\"0\" height=\"360\" src=\"//www.youtube.com/embed/2QeeGzgpy8A\" width=\"640\"></iframe></p>\n";

    $g_lang["m_title"] = "Помощь в создании графа по матрице смежности";
    $g_lang["m_keyWords"] = "граф, матрица смежности, построить граф онлайн.";
    $g_lang["m_description"] = "Помощь в построении графа по матрице смежности онлайн";
?>
