<?php
    $g_lang["title_notg"] = "Поддержать Граф Онлайн";
    $g_lang["text"] = "<p>Проект \"Граф Онлайн\" - бесплатный образовательный ресурс объявляет о сборе средств для поддержки и развития проекта.</p>" .
        "<p>Сервис в чём-то уникальный и его хочется делать ещё лучше и полезнее. Если он действительно помогает вам решить поставленные задачи, то вы можете помочь его развивать, стать частью нашей команды. Нам кажется это наиболее правильная модель финанстирования проекта, так как не хочется портить образовательный ресурс размещением рекламы или урезанием функционала в угоду платным подпискам. Если у вас есть вопросы всегда пишите на <a href=\"mailto:admin@graphonline.ru\">admin@graphonline.ru</a>.</p>" .
        "<p>Мы с вами уже смогли собрать средства на продления хостинга и теперь сайт будет спокойно работать до 2019 года. <br>
        <img src=\"/i/image/news/hosting.png\"><br>
        </p>";

    $g_lang["m_title"] = "Graph online - поддержать проект";
    $g_lang["m_keyWords"] = "граф, построение графа, поддержать проект";
    $g_lang["m_description"] = "Граф Онлайн поддержать проект";
?>
