<?php
    $g_lang["title_notg"] = "Поддержать Граф Онлайн";
    $g_lang["text"] = "<p>Проект \"Граф Онлайн\" - бесплатный образовательный ресурс объявляет о сборе средств для поддержки и развития проекта.</p>" .
        "<p>Сервис в чём-то уникальный и его хочется делать ещё лучше и полезнее. Если он действительно помогает вам решить поставленные задачи, то вы можете помочь его развивать, стать частью нашей команды. Нам кажется это наиболее правильная модель финанстирования проекта, так как не хочется портить образовательный ресурс размещением рекламы или урезанием функционала в угоду платным подпискам. Если у вас есть вопросы всегда пишите на <a href=\"mailto:admin@graphonline.ru\">admin@graphonline.ru</a>.</p>" .
        "<p>В данный момент мы cобираем деньги на продление хостинга и имени сайта. Сайт уже существует третий год и только сейчас мы решили попросить помощи пользователей. Всего требуется 1500 р. Это небольшая сумма, но очень важная, чтобы понять настолько ли наш сервис полезен, что вы готовы поддерживать его материально.</p>";

    $g_lang["m_title"] = "Graph online - поддержать проект";
    $g_lang["m_keyWords"] = "граф, построение графа, поддержать проект";
    $g_lang["m_description"] = "Граф Онлайн поддержать проект";
?>
