<?php

    $g_lang["text"] = "<p>Построить графа, найти кратчайшего пути&nbsp;и многое другое. В разделе Справка вы <a href=\"/help\">найдете обучающие видео</a>.</p>\n";
    $g_lang["add_node"] = "Добавить вершину";
    $g_lang["connect_nodes"] = "Соединить вершины";
    $g_lang["delete"] = "Удалить";
    $g_lang["default"] = "Перемещение";
    $g_lang["short_path"] = "Найти кратчайший путь";
    $g_lang["save_direction_choose"] = "Сохранить тип дуги (направленная или нет)";
    $g_lang["edge_weight"] = "Вес дуги";
    $g_lang["save_weight_choose"] = "использовать значение для следующих дуг";
    $g_lang["default_weight"] = "ненагруженный";
    $g_lang["browser_no_support"] = "Ваш браузер не поддерживается. Попробуйте обновить ваш браузер до последней версии.";
    $g_lang["select_and_move_objects"] = "Выделите и перемещайте объекты или перемещайте рабочую область.";
    $g_lang["move_cursor_for_moving"] = "Перемещайте курсор для перемещения объекта";
    $g_lang["add_graph"] = "Добавить ребро";
    $g_lang["orint_edge"] = "Ориентированную";
    $g_lang["not_orint_edge"] = "Неориентированную";
    $g_lang["show_adjacency_matrix"] = "Матрица смежности";
    $g_lang["save"] = "Сохранить";
    $g_lang["cancel"] = "Отмена";
    $g_lang["adjacency_matrix_description"] = "Задайте матрицу смежности. Используйте запятую \",\" в качестве разделителя";
    $g_lang["adjacency_matrix_bad_format"] = "Матрица имеет неправильный формат. Используйте запятую \",\" в качестве разделителя. Матрица должна иметь одинаковое количество столбцов и строк.";
    $g_lang["delete_all"] = "Удалить всё";
    $g_lang["click_to_add_vertex"] = "Кликните на рабочую область, чтобы добавить вершину. <span style=\"float:right;\">Нумерация вершин " .
    "<select id=\"enumVertexsText\">" .
    "</select></span>";
    $g_lang["select_first_vertext_to_connect"] = "Выделите первую вершину для создания дуги";
    $g_lang["select_second_vertext_to_connect"] = "Выделите вторую вершину, которую хотите соединить";
    $g_lang["select_start_short_path_vertex"] = "Выделите вершину, из которой хотите найти кратчайший путь";
    $g_lang["select_finish_short_path_vertex"] = "Выделите конечную вершину кратчайшего пути";
    $g_lang["short_path_result"] = "Расстояние между вершинами %d";
    $g_lang["path_not_exists"] = "Пути не существует";
    $g_lang["select_object_to_delete"] = "Кликните по объекту, который хотите удалить";
    $g_lang["shortest_dist"] = "Мин. расстояние = ";
    $g_lang["show_incidence_matrix"] = "Матрица инцидентности";
    $g_lang["incidence_matrix_description"] = "Задайте матрицу инцидентности. Используйте запятую \",\" в качестве разделителя";
    $g_lang["incidence_matrix_bad_format"] = "Матрица имеет неправильный формат. Используйте запятую \",\" в качестве разделителя.";
    $g_lang["this_is_graph_link"] = "Граф сохранён и будет доступен по ссылке:";
    $g_lang["share_graph_text"] = "Граф Онлайн: Сохранённый граф";
    $g_lang["share_graph_description"] = "Опубликовать ссылку в социальных сетях:";
    $g_lang["graph"] = "Граф";
    $g_lang["save_dialog_title"] = "Сохранение графа";
    $g_lang["close_button"] = "закрыть";
    $g_lang["connected_component"] = "Найти компоненты связности";
    $g_lang["sick_connected_component_result"] = "Число слабо связных компонентов равно ";
    $g_lang["connected_component_result"] = "Число компонентов связности графа равно ";
    $g_lang["new_graph"] = "Создать граф";
    $g_lang["what_do_you_think"] = "Что вы думаете о сайте?";
    $g_lang["name"] = "Имя (email для ответа)";
    $g_lang["feedback"] = "Написать";
    $g_lang["send"] = "Отправить";
    $g_lang["write_to_us"] = "Напишите нам";
    $g_lang["fix_matrix_button"] = "исправить матрицу";
    $g_lang["open_matrix_help"] = "справка";
    $g_lang["wrong_matrix_title"] = "Матрица имеет неправильный формат";
    $g_lang["bad_adj_matrix_message"] = "Ошибка создания графа. Матрица смежности имеет неправильный формат. Нажмите кнопку \"исправить матрицу\" чтобы исправить матрицу или кнопку \"справка\" чтобы открыть справку о формате матрицы";
    $g_lang["bad_inc_matrix_message"] = "Ошибка создания графа. Матрица инцидентности имеет неправильный формат. Нажмите кнопку \"исправить матрицу\" чтобы исправить матрицу или кнопку \"справка\" чтобы открыть справку о формате матрицы";
    $g_lang["save_image"] = "Снимок рабочей области";
    $g_lang["save_full_image"] = "Сохранить изображение графа";
    $g_lang["save_print_image"] = "Изображение графа для печати (ч\б)";
    $g_lang["open_saved_image_browser"] = "Открыть изображение в браузере";
    $g_lang["download_saved_image"] = "Скачать сохранённое изображение";
    $g_lang["save_image_dialog_title"] = "Сохранение изображения графа";
    $g_lang["full_report"] = "Полный отчёт";
    $g_lang["short_report"] = "Краткий отчёт";
    $g_lang["find_eulerian_loop"] = "Найти Эйлеров цикл";
    $g_lang["has_eulerian_loop"] = "Граф содержит Эйлеров цикл";
    $g_lang["has_not_eulerian_loop"] = "Граф не содержит Эйлеров цикл";
    $g_lang["algorithms"] = "Алгоритмы";
    $g_lang["processing"] = "Обработка...";

    $g_lang["m_title"] = "Сервис для построения графов онлайн | GraphOnline";
    $g_lang["m_keyWords"] = "построение графов онлайн, граф онлайн, графический редактор онлайн, редактор графов, визуализация графов, алгоритмы на графах, рисование графов онлайн, онлайн сервис для графов, построение направленных графов, построение взвешенных графов, поиск кратчайшего пути в графе, построение графа по вершинам и рёбрам, графы и деревья онлайн, визуализатор графов для студентов, онлайн графы по алгоритму Дейкстры, построить взвешенный граф онлайн, редактирование графов с сохранением, онлайн построение графов для олимпиад, как визуализировать ориентированный граф, интерактивный редактор графов, сервис для построения графов для школы, онлайн инструмент для графов для преподавателей, инструмент для проверки графов в вузе, построение графов для научной работы, Поиск Кратчайшего пути алгоритмом Дейкстры, Поиск компонентов связности графа, Поиск Эйлерового цикла и пути, Поиск Минимального Остовного дерева, Расчёт степени вершин, Поиск Максимального Потока.";
    $g_lang["m_description"] = "Построить и визуализировать графы онлайн. Удобный редактор, алгоритмы поиска путей, поддержка взвешенных и направленных графов.";
    $g_lang["m_description_long"] = "GraphOnline — это удобный онлайн-инструмент для построения, редактирования и визуализации графов. Поддержка направленных и ненаправленных графов, алгоритмы (Дейкстра, Прим, Крускал и др.), сохранение и экспорт. Подходит для студентов, преподавателей и специалистов в области теории графов.";
    $g_lang["title_notg"] = "Cервис для построения графов";

    $g_lang["view"] = "Вид";
    $g_lang["view_keys"] = "Для позиционирования используйте клавиши \"ц\", \"ф\", \"ы\", \"в\" или \"w\", \"a\", \"s\", \"d\".";
    $g_lang["zoom_fit"] = "По размеру графа";
    $g_lang["zoom_in"]   = "Увеличить";
    $g_lang["zoom_out"]  = "Уменьшить";

    $g_lang["move_workspace"]  = "Перемещать рабочую область";


    $g_lang["custom"]  = "Текст";
    $g_lang["enter_vertex_title"]  = "Введите текст";
    
    $g_lang["rename_vertex"] = "Переименовать вершину";
    $g_lang["rename_text"]   = "Переименовать";
    
    $g_lang["current_language"] = "ru";
    

    $g_lang["developer_tools_title"] = "Создание алгоритмов";
    $g_lang["developer_tools_text"] = "Вставьте ваш алгоритм ниже и нажмите \"Выполнить\"";
    $g_lang["developer_tools_run"] = "Выполнить";
    $g_lang["developer_tools_submit"] = "Добавить на сайт";
    
    $g_lang["algorithm_was_sent"] = "Алгоритм отправлен";
    $g_lang["your_algorithm_was_sent"] = "Ваш алгоритм отправлен на модерацию и в случае успеха он будет добавлен на сайт.";
    
    $g_lang["edit_weight"] = "Изменить вес";
    
    $g_lang["group_rename"] = "Групповое переименование";
    $g_lang["enter_vertices_text_in_each_line"] = "Введите текст для каждой вершины в отдельную строку";
    $g_lang["or"] = "или";
    $g_lang["vote"] = "Опрос";
    $g_lang["vote_question"] = "Какие функции нам добавить в первую очередь?";
    $g_lang["what_algorithm_need"] = "Пожалуйста, напишите, какого алгоритма вам не хватает. <a href=\"/donate\" style=\"text-decoration: underline\" target=\"_blank\">Поддерживать проект</a>.";

    $g_lang["recommend_algorithm"] = "Рекомендовать алгоритмы";

    $g_lang["what_algorithm_we_have"] = "Сервис уже поддерживает следующий функционал: <a href=\"/wiki/Справка/ПоискКратчайшегоПути\" target=\"_blank\" style=\"text-decoration: underline\">Поиск пути алгоритмом Дейкстры</a>, <a href=\"/wiki/Справка/МатрицаСмежности\" target=\"_blank\" style=\"text-decoration: underline\">матрицу смежности</a>, <a href=\"/wiki/Справка/МатрицаИнцидентности\" target=\"_blank\" style=\"text-decoration: underline\">матрицу инцидентности</a>.";

    $g_lang["has_eulerian_path"] = "Граф содержит Эйлерову цепь";
    $g_lang["has_not_eulerian_path"] = "Граф не содержит Эйлерову цепь";

    $g_lang["min_dist_matrix_description"] = "Матрица минимальных расстояний графа";
    
    $g_lang["graphOfMinDist"] = "Граф минимальных расстояний.";
    $g_lang["checkToSave"]    = "Нажмите для сохранения";
    $g_lang["showDistMatrix"] = "Показать матрицу расстояний";
    $g_lang["distMatrixText"] = "Матрица расстояний";

    $g_lang["selectStartVertexForMaxFlow"]   = "Выделите исток максимального потока";
    $g_lang["selectFinishVertexForMaxFlow"]  = "Выделите сток максимального потока";
    $g_lang["maxFlowResult"]  = "Максимальный поток из %2 в %3 равен %1";
    $g_lang["flowNotExists"]  = "Поток из %1 в %2 не существует";

    $g_lang["sourceVertex"]  = "Исток";
    $g_lang["sinkVertex"]    = "Сток";

    $g_lang["export_graph"]    = "Экспортировать граф";
    $g_lang["import_graph"]    = "Импортировать граф";

    $g_lang["has_hamiltonian_path"] = "Граф содержит Гамильтонову цепь";
    $g_lang["has_not_hamiltonian_path"] = "Граф не содержит Гамильтонову цепь";

    $g_lang["has_hamiltonian_loop"] = "Граф содержит Гамильтонов цикл";
    $g_lang["has_not_hamiltonian_loop"] = "Граф не содержит Гамильтонов цикл";

    $g_lang["start_traversal"]  = "Выберите начальную вершину обхода";
    $g_lang["traversal_order"]  = "Порядок обхода: ";

    $g_lang["curve_edge"]       = "Изгиб дуги";
    $g_lang["undo"]             = "Отменить";

    $g_lang["opensource_message"] = "Наш проект стал проектом с открытым исходным кодом. Подробнее...";

    $g_lang["we_are_improving"] = "Мы улучшаем Graphonline, если вы столкнулись с проблемами напишете нам: admin@graphonline.ru";

    $g_lang["settings"] = "Настройки";
    $g_lang["common_vertex_settings"]   = "Обычных вершин";
    $g_lang["selected_vertex_settings"] = "Выделенных вершин";
    $g_lang["common_edge_settings"]     = "Обычных дуг";
    $g_lang["selected_edge_settings"]   = "Выделенных дуг";

    $g_lang["common_color"] = "Основной цвет";
    $g_lang["stroke_color"] = "Цвет обводки";
    $g_lang["stroke_size"]  = "Толщина обводки";
    $g_lang["text_color"]   = "Цвет текста";
    $g_lang["save_graph"]   = "Сохранить граф";
    $g_lang["default"]      = "По умолчанию";
    $g_lang["vertex_draw_style"] = "Стиль отрисовки вершины";
    $g_lang["text_background"]   = "Фон текста";
    $g_lang["edge_draw_style"]   = "Стиль отрисовки дуги";

    $g_lang["color"] = "Цвет";
    $g_lang["alpha"] = "Прозрачность";

    $g_lang["background_style"] = "Фона";

    $g_lang["adjacency_matrix_multigraph_description"] = "Для мультиграфа матрица содержит значения минимальных дуг между вершинами.";

    $g_lang["replace_edge"] = "заменить текущую";
    $g_lang["add_edge"] = "добавить (мультиграф)";

    $g_lang["graph_is_multi_message"]   = "Мультиграф не поддерживает все алгоритмы";
    $g_lang["graph_is_general_message"] = "";
    $g_lang["text_above_edge"] = "Текст над дугой";

    $g_lang["select_groupe_mac"] = "Выделите несколько объектов используя Cmd⌘.";
    $g_lang["select_groupe_win"] = "Выделите несколько объектов используя Ctrl.";
    $g_lang["drag_select_group"] = "Перемещайте группу.";
    $g_lang["copy_select_group"] = "Копировать";
    $g_lang["remove_select_group"] = "Удалить";

    $g_lang["bfs_name"] = "Поиск в ширину";
    $g_lang["coloring_name"] = "Раскраска графа";
    $g_lang["find_connection_component_name"] = "Найти компоненты связности";
    $g_lang["dfs_name"] = "Поиск в глубину";
    $g_lang["eulerin_loop_name"] = "Найти Эйлеров цикл";
    $g_lang["eulerin_path_name"] = "Найти Эйлерову цепь";
    $g_lang["fiold_name"] = "Алгоритм Флойда — Уоршелла";
    $g_lang["graph_reorder_name"] = "Упорядочить граф";
    $g_lang["hamiltoian_cycle_name"] = "Найти Гамильтонов цикл";
    $g_lang["hamiltonian_path_name"] = "Найти Гамильтонову цепь";
    $g_lang["max_flow_name"] = "Поиск максимального потока";
    $g_lang["minimum_spanning_tree"] = "Поиск минимального остовного дерева";
    $g_lang["modern_graph_style_name"] = "Визуализация на основе весов";
    $g_lang["radius_and_diameter_name"] = "Поиск радиуса и диаметра графа";
    $g_lang["find_short_path_name"] = "Поиск кратчайший путь алгоритмом Дейкстры";
    $g_lang["find_short_path_belman_ford_name"] = "Поиск кратчайший путь алгоритмом Беллмана-Форда";

    $g_lang["vertices_degree_name"] = "Рассчитать степень вершин";

    $g_lang["min_spanning_tree_res_is"] = "Вес минимального остовного дерева равен ";
    $g_lang["min_spanning_tree_ignore_direction"] = "Мы игнорировали ориентацию дуг при расчёте.";
    $g_lang["min_spanning_tree_graph_not_connected"] = "Граф не является связным";

    // IsomorphismCheck.js
    $g_lang['select_first_graph_isomorphism_check'] = "Выделите первый граф для проверки на изоморфизм. Кликните по любой вершине графа";
    $g_lang['select_second_graph_isomorphism_check'] = "Выделите второй граф для проверки на изоморфизм. Кликните по любой вершине графа";
    $g_lang['select_first_graph_pattern_check'] = "Выделите граф, которому должны быть изоморфны подграфов. Кликните по любой вершине графа";
    $g_lang['select_second_graph_for_search_subgraph'] = "Выделите граф в котором необходимо найти изоморфные подграфы. Кликните по любой вершине графа";
    $g_lang['graphs_isomorph'] = "Графы изоморфны";
    $g_lang['graphs_not_isomorph'] = "Графы не изоморфны";
    $g_lang['number_of_isomorph_subgraph_is'] = "Количество изоморфных подграфов равно ";
    $g_lang['graph_has_no_isomorph_subgraph'] = "Граф не содержит изоморфных подграфов";
    $g_lang['search_isomorph_subgraph'] = "Поиск изоморфных подграфов";
    $g_lang['subgraph_no'] = "Изоморфный подграф № ";
    $g_lang['graph_has_no_atleast_2_graphs'] = "Для использования алгоритма необходимо создать хотя бы 2 не связных графа";
    $g_lang['isomorphism_check'] = "Проверка изоморфности графов<sub>beta</sup>";

    // RadiusAndDiameter.js
    $g_lang['graph_is_disconnected'] = "Граф не является связным";
    $g_lang['graph_is_trivial'] = "Граф содержит только одну вершину";
    $g_lang['graph_radius'] = "Радиус графа";
    $g_lang['graph_diameter'] = "Диаметр графа";
    $g_lang['vertex_central'] = "Центральная";
    $g_lang['vertex_peripheral'] = "Периферийная";

    // VerticesDegree.js
    $g_lang['maximum_degree_of_graph'] = "Максимальная степень вершин графа равна";

    // Coloring.js
    $g_lang['color_number'] = "Найденное количество цветов";

    $g_lang['done'] = "Готово";

    $g_lang['action'] = "Действия";
    $g_lang['common_edge_style'] = "Стиль обычной дуги";
    $g_lang['selected_edge_style'] = "Стиль выделенной дуги";
    $g_lang['common_vertex_style'] = "Стиль обычной вершины";
    $g_lang['selected_vertex_style'] = "Стиль выделенной вершины";

    $g_lang['shape'] = "Форма";
    $g_lang['circle'] = "Круг";
    $g_lang['squere'] = "Квадрат";
    $g_lang['triangle'] = "Треугольник";
    $g_lang['pentagon'] = "Пятиугольник";
    $g_lang['textbox'] = "Текстовое поле";
    $g_lang['vertex_diameter'] = "Размер вершины";

    $g_lang['additional_text_color'] = "Цвет другого текста"; 
    $g_lang['center'] = "По центру";
    $g_lang['on_up'] = "Сверху";

    $g_lang['weight_position'] = "Позиция веса";    
    $g_lang['text_position'] = "Позиция текста";
    $g_lang['line_style']    = "Стиль дуги";
    $g_lang['edge_width']    = "Толщина дуги";
    $g_lang['selected_index'] = "Группа выделения";    

    $g_lang['all'] = "Все";

    //FindAllPatches.js
    $g_lang['find_all_pathes'] = "Поиск всех путей";
    $g_lang['number_of_pathes_from'] = "Количество путей из ";
    $g_lang['to'] = " в ";
    $g_lang['are'] = " равно ";
    $g_lang['path_n'] = "Путь №";
    $g_lang['selected_finish_vertex'] = "Выделите конечную вершину";
    $g_lang['selected_start_vertex'] = "Выделите начальную вершину";

    // FindShortPatchsFromOne.js
    $g_lang['find_all_paths_from_vertex'] = "Найти все кратчайшие пути от вершины";
    $g_lang['distance_from'] = "Расстояние от ";
    $g_lang['path_to'] = "Путь до ";

    $g_lang['search_pathes']    = "Поиск путей";
    $g_lang['other_algorithms'] = "Другие алгоритмы";

    $g_lang['use_context_menu'] = "Используйте контекстное меню для дополнительных действий.";

    $g_lang['find_longest_path'] = "Поиск самого длинного пути";
    $g_lang['length_of_longest_path_from'] = "Длина самого длинного пути равна ";


    $g_lang['additionl_actions'] = "Особые действия";
    $g_lang['reverse_all_edges'] = "Поменять направление всех дуг";
    $g_lang['make_all_undirected'] = "Сделать все дуги неориентированными";
    $g_lang['make_all_directed'] = "Сделать все дуги ориентированными";  

    $g_lang['save_svg_image'] = "Сохранить граф в SVG";  

    $g_lang["bad_inc_pair_message"] = "Ошибка создания графа. Список рёбер имеет неправильный формат. Нажмите кнопку \"исправить\" чтобы исправить список или кнопку \"справка\" чтобы открыть справку о формате";
    $g_lang["edge_list_wrong_format"] = "Неправильный формат списка рёбер";
    $g_lang["fix_button"] = "исправить";

    $g_lang["snowflake"] = "Снежинка";

    $g_lang["save_edge_for_future"] = "Сохранить дугу для повторного использования";    
    $g_lang["reuse_saved_edge"] = "Использовать сохраненную дугу";

    $g_lang["max_clique"] = "Максимальная клика";
    $g_lang["max_clique_not_found"] = "Максимальная клика не найдена";
    $g_lang["max_clique_size_is"] = "Размер Максимальной клики равен ";
    $g_lang["max_clique_contains"] = ". Клика содержит следующие вершины: ";

    $g_lang["remove_background_image"] = "Удалить фоновое изображение";
    $g_lang["upload"] = "Загрузить";
    $g_lang["background_image"] = "Фоновое изображение";

    $g_lang['wrong_image_background_format'] = "Неправильный формат изображения. Только JPEG и PNG поддерживаются";
    $g_lang['wrong_image_background_size'] = "Размер изображения слишком большой. Размер изображения должен быть меньше {0} пикселей.";    

    $g_lang['text_size'] = "Размер текста";

    $g_lang['you_have_autosave'] = "Найдено автосохранение для этого графа.";
    $g_lang['load_oiginal_or_autosaved'] = "Вы хотите загрузить оригинальный граф или автосохранение?";
    $g_lang['use_mouse_for_moving'] = "Используйте 🖱️ для перемещения";
    $g_lang['original_graph'] = "Оригинальный граф";
    $g_lang['autosaved_graph'] = "Автосохранение графа";

    $g_lang['open_last_used_graph'] = "Открыть недавний граф";

    $g_lang['vertex_name_place_holder'] = "вершина";

    $g_lang["max_independent_set"] = "Максимальное независимое множество";
    $g_lang["max_independent_set_not_found"] = "Максимальное независимое множество не найдена";
    $g_lang["max_independent_set_size_is"] = "Размер Максимального независимого множества равен ";
    $g_lang["max_independent_set_contains"] = ". Множество содержит следующие вершины: ";

    $g_lang['find_all_shortest_pathes'] = "Найти все кратчайшие пути между вершинами";
    $g_lang['number_of_shortest_pathes_from'] = "Количество кратчайших путей из ";
    $g_lang['length_is'] = "длина равна ";

    $g_lang['graph_is_to_large'] = "Граф слишком большой для этого алгоритма (<span id=\"current_graph_size\">X</span> вершин, <span id=\"current_edge_number\">X</span> дуг).";
    $g_lang['algorith_supports_max_limit'] = "Алгоритм поддерживает графы размером не больше <span id=\"algorithm_max_limit\">X</span> вершин и <span id=\"algorithm_edge_limit\">X</span> дуг.";
    $g_lang['error'] = "Ошибка";

    $g_lang['salesman_problem'] = "Задача коммивояжёра";
    $g_lang['no_solution'] = "Решения не существует";
    $g_lang['shortest_loop_is'] = "Кратчайший цикл имеет длинну ";
    $g_lang['salesman_path_problem'] = "Задача коммивояжёра для пути";
    $g_lang['shortest_path_is'] = "Кратчайший путь имеет длинну ";
?>
