<?php

    $g_lang["menu_0"] = "Главная";
    $g_lang["menu_1"] = "Создать граф";
    $g_lang["menu_2"] = "Справка";
    $g_lang["menu_3"] = "Обратная связь";
    $g_lang["menu_4"] = "По матрице смежности";
    $g_lang["menu_5"] = "По матрице инцидентности";
    $g_lang["menu_6"] = "Вики";
    $g_lang["menu_7"] = "Быстрый старт";
    $g_lang["menu_8"] = "Новости";
    $g_lang["menu_9"] = "По примеру";
    $g_lang["menu_10"] = "Открытый исходный код";
    $g_lang["menu_11"] = "По списку рёбер";
    $g_lang["footer_info"] = "<a href=\"/\">Граф Онлайн</a> — онлайн-редактор графов и инструмент для их визуализации и построения. Поддерживает алгоритмы поиска путей, нахождения максимального потока, а также Эйлерова и Гамильтонова циклов.\n";
    $g_lang["lang"] = "Язык";
?>