<?php

    $g_lang["head_no_tags"] = "Създаване на граф от матрица на инцидентност";
    $g_lang["text"] = "<p>На тази страница може да въведете матрица на инцидентност и да начертаете граф</p>\n";
    $g_lang["incidence_matrix_description"] = "Въведете матрица на инцидентност. Използвайте запетая \",\" като разделител и натиснете \"Чертаене на граф\".";
    $g_lang["incidence_matrix_bad_format"] = "Матрицата е неправилна. Използвайте запетая \",\" като запетая. Матрицата трябва да е квадратна.";
    $g_lang["plot_graph_button"] = "Чертаене на граф";
    $g_lang["matrix_matrix_input"] = "Въведете в таблица";
    $g_lang["text_matrix_input"] = "Въведете като текст";
    $g_lang["incidence_matrix_description_matrix"] = "Въведете матрица на инцидентност. Натиснете \"Чертаене на граф\" за да начертаете.";
    $g_lang["add_edge_to_matrix"] = "Добавете ребро";
    $g_lang["add_node_to_matrix"] = "Добавете връх";

    $g_lang["m_title"] = "Създаване на граф от матрица на инцидентност";
    $g_lang["m_keyWords"] = "онлайн граф, чертаене на граф, създаване на граф от матрица на инцидентност, матрица на инцидентност";
    $g_lang["m_description"] = "Създаване на граф от матрица на инцидентност и визуална репрезентация онлайн";

    $g_lang["use_ctrl_to_move_cells"] = "Използвайте Ctrl + &#8592; &#8593; &#8594; &#8595; клавиши, за да се движите между клетки.";
?>