<?php

    $g_lang["title_notg"] = "Помощ за Онлайн Граф";
    $g_lang["text"] = "<p><iframe allowfullscreen=\"\" frameborder=\"0\" height=\"315\" src=\"//www.youtube.com/embed/Sx4tOe3bWNg\" width=\"560\"></iframe></p>\n<h3>Добавете връх</h3>\n\n<p>За да създаете граф трябва <a href=\"http://graphonline.ru/en/\">да добавите върхове</a>. Изберете «Добавете връх» и щракнете върху работното поле.</p>\n\n<p><img alt=\"Добавете върхове\" src=\"/i/image/help/addVertexEn.gif\" /></p>\n\n<p>&nbsp;</p>\n\n<h3>Свържете върхове</h3>\n\n<p>За да свържете върхове трябва <a href=\"http://graphonline.ru/en/\">да изберете «Свържете върхове»</a> и да щракнете на първия връх и след това на втория.</p>\n\n<p><img alt=\"Свържете върхове в Онлайн Граф\" src=\"/i/image/help/addEdgeEn.gif\"/></p>\n\n<p>В диалоговия прозорец трябва да изберете тегло или да оставите без такова. Също така можете да изберете и вида граф: ориентиран или неорентиран. </p>\n\n<h3>Намерете най-краткия път</h3>\n\n<p>Изберете <a href=\"http://graphonline.ru/en/\">«Намерете най-краткия път»</a> в падащото меню. Изберете крайните върхове. Ако между тях има път, ще го видите на графа. Използваме алгоритъма на Дейкстра.</p>\n\n<p><img alt=\"Намерете най-краткия път на граф\" src=\"/i/image/help/findShortPathesEn.gif\" /></p>\n\n<p>&nbsp;</p>\n";

    $g_lang["m_title"] = "Онлайн Граф помощ";
    $g_lang["m_keyWords"] = "граф, помощ";
    $g_lang["m_description"] = "Помощна страница за Онлайн Граф";
?>