<?php

    $g_lang["title_notg"] = "Намерете най-краткия път";
    $g_lang["text"] = "<p>Създайте граф и намерете най-краткия път. На страницата Помощ <a href=\"/en/help\">ще намерите видео урок</a>.</p>\n";
    $g_lang["add_node"] = "Добавете връх";
    $g_lang["connect_nodes"] = "Свържете върхове";
    $g_lang["delete"] = "Премахнете обект";
    $g_lang["default"] = "Влачете";
    $g_lang["short_path"] = "Намерете най-краткия път";
    $g_lang["save_direction_choose"] = "Запазете вид ребро";
    $g_lang["edge_weight"] = "Тежест на реброто";
    $g_lang["save_weight_choose"] = "Използвайте стойността за следващите ребра";
    $g_lang["default_weight"] = "Няма тежест";
    $g_lang["browser_no_support"] = "Браузърът ви не е поддържан";
    $g_lang["select_and_move_objects"] = "Изберете и местете обекти с мишката или местете работното пространство.";
    $g_lang["move_cursor_for_moving"] = "Влачете курсора, за да местите обекти";
    $g_lang["add_graph"] = "Добавете ребро";
    $g_lang["orint_edge"] = "Ориентиран";
    $g_lang["not_orint_edge"] = "Неориентиран";
    $g_lang["show_adjacency_matrix"] = "Матрица на съседство";
    $g_lang["save"] = "Запазете";
    $g_lang["cancel"] = "Прекъснете";
    $g_lang["adjacency_matrix_description"] = "Подготовка на матрица на съседство. Използвайте запетая \",\" като разделител";
    $g_lang["adjacency_matrix_bad_format"] = "Матрицата е неправилна. Използвайте запетая \",\" като запетая. Матрицата трябва да е квадратна";
    $g_lang["delete_all"] = "Премахнете всички";    
    $g_lang["click_to_add_vertex"] = "Щракнете върху работното платно, за да добавите нов връх. <span style=\"float:right;\">Изброяване на върхове "  .
    "<select id=\"enumVertexsText\">" .
    "</select></span>";
    $g_lang["select_first_vertext_to_connect"] = "Изберете първи връх за ребро";
    $g_lang["select_second_vertext_to_connect"] = "Изберете втори връх за ребро";
    $g_lang["select_start_short_path_vertex"] = "Изберете началния връх за най-кратък път";
    $g_lang["select_finish_short_path_vertex"] = "Изберете крайния връх за най-кратък път";
    $g_lang["short_path_result"] = "Най-кратката дистанция е %d";
    $g_lang["path_not_exists"] = "Такъв път не съществува";
    $g_lang["select_object_to_delete"] = "Кликнете върху обекта, за да премахнете";
    $g_lang["shortest_dist"] = "Най-ниската дистанция е ";
    $g_lang["show_incidence_matrix"] = "Матрица на инцидентност";
    $g_lang["incidence_matrix_description"] = "Подготовка на матрица на инцидентност. Използвайте запетая \",\" като разделител";
    $g_lang["incidence_matrix_bad_format"] = "Матрицата е неправилна. Използвайте запетая \",\" като запетая. Матрицата трябва да е квадратна";
    $g_lang["this_is_graph_link"] = "Графът бе запазен. Последвайте връзката, за да го видите.";
    $g_lang["share_graph_text"] = "Онлайн Граф: Запазен граф";
    $g_lang["share_graph_description"] = "Споделете връзка в социалните мрежи:";
    $g_lang["graph"] = "Граф";
    $g_lang["save_dialog_title"] = "Запазване на граф";
    $g_lang["close_button"] = "Затворете";
    $g_lang["connected_component"] = "Намерете свързани компоненти";
    $g_lang["sick_connected_component_result"] = "Броят слабо свързани компоненти е ";
    $g_lang["connected_component_result"] = "Броят свързани компоненти е ";
    $g_lang["new_graph"] = "Създайте граф";
    $g_lang["what_do_you_think"] = "Какво мислите за уеб сайта?";
    $g_lang["name"] = "Име (email адрес за обратна връзка)";
    $g_lang["feedback"] = "Обратна връзка";
    $g_lang["send"] = "Пратете";
    $g_lang["write_to_us"] = "За да ни питате въпрос или да споделите коментар, пишете ни на ";
    $g_lang["fix_matrix_button"] = "Поправете матрицата";
    $g_lang["open_matrix_help"] = "Помощ";
    $g_lang["wrong_matrix_title"] = "Матрицата има грешен формат";
    $g_lang["bad_adj_matrix_message"] = "Граф не може да бъде създаден. Матрицата на съседство е с грешен формат. Щракнете \"поправете матрицата\", за да оправите матрицата или \"Помощ\", за да намерите допълнително информация за матрицата на съседство";
    $g_lang["bad_inc_matrix_message"] = "Cannot create graph. Incidence Matrix has wrong format. Click \"fix matrix\" button to fix matrix or \"help\" button to open help about Incidence Matrix format";
    $g_lang["save_image"] = "Снимка на работното платно";
    $g_lang["save_full_image"] = "Запазете снимка на графа";
    $g_lang["save_print_image"] = "Черно-бяло изображение на графа за принтиране";
    $g_lang["open_saved_image_browser"] = "Отворете изображението в браузъра";
    $g_lang["download_saved_image"] = "Изтеглете запазеното изображение";
    $g_lang["save_image_dialog_title"] = "Запазете изображение на графа";
    $g_lang["full_report"] = "Пълен доклад";
    $g_lang["short_report"] = "Кратък доклад";
    $g_lang["find_eulerian_loop"] = "Намерете Ойлеров път";
    $g_lang["has_eulerian_loop"] = "Графът има Ойлеров път";
    $g_lang["has_not_eulerian_loop"] = "Графът няма Ойлеров път";
    $g_lang["algorithms"] = "Алгоритми";
    $g_lang["processing"] = "Зарежда се...";
    $g_lang["view"] = "Изглед";
    $g_lang["view_keys"] = "За придвижване използвайте клавишите \"w\", \"a\", \"s\", \"d\".";
    $g_lang["zoom_fit"] = "Изпълване на екрана";
    $g_lang["zoom_in"] = "Приближаване на мащаба";
    $g_lang["zoom_out"] = "Отдалечаване на мащаба";
    $g_lang["move_workspace"] = "Придвижете работното платно";
    $g_lang["custom"] = "Ръчно въведен текст";
    $g_lang["enter_vertex_title"] = "Въведете заглавие";
    $g_lang["rename_vertex"] = "Преименувайте връх";
    $g_lang["rename_text"] = "Преименувайте";

    $g_lang["m_title"] = "Създайте граф онлайн и намерете най-краткия път или използвайте друг алгоритъм";
    $g_lang["m_keyWords"] = "онлайн граф, намерете най-краткия път, визуализация на граф, граф на матрица на съседство, матрица на съседство, матрица на инцидентност, търсете свързан компонент, ойлеров цикъл, минимално обхващащо дърво";
    $g_lang["m_description"] = "Създайте граф онлайн и използвайте различни алгоритми: намерете най-краткия път, намерете матрица на съседство, намерете минимално обхващащо дърво и други";
    $g_lang["current_language"] = "bg";
    
    
    $g_lang["developer_tools_title"] = "Създайте алгоритъм";
    $g_lang["developer_tools_text"] = "Поставете вашия алгоритъм и щракнете върху Напред";
    $g_lang["developer_tools_run"] = "Напред";
    
    $g_lang["developer_tools_submit"] = "Изпратете към сайта";
    
    $g_lang["algorithm_was_sent"] = "Алгоритъмът бе пратен";
    $g_lang["your_algorithm_was_sent"] = "Вашият алгоритъмът бе пратен и при успех ще бъде добавен към сайта.";
    
    $g_lang["edit_weight"] = "Редактирайте теглото на ребро";
    
    $g_lang["group_rename"] = "Групово преименуване";
    $g_lang["enter_vertices_text_in_each_line"] = "Въведете текст за всяко ребро на отделен ред";
    $g_lang["or"] = "или";
    $g_lang["vote"] = "Гласувайте";
    $g_lang["vote_question"] = "Какви функции да бъдат добавени най-напред?";

    $g_lang["what_algorithm_need"] = "Моля, пишете ни с препоръки какви видове алгоритми да добавим към уебсайта.";

    $g_lang["recommend_algorithm"] = "Препоръчайте алгоритми";

    $g_lang["what_algorithm_we_have"] = "Нашата услуга вече поддържа следните функционалности: <a href=\"/en/wiki/Help/FindTheShortestPath\" target=\"_blank\" style=\"text-decoration: underline\">Намерете най-краткия път с помощта на алгоритъма на Дейкстра</a>, <a href=\"/en/wiki/Help/AdjacencyMatrix\" target=\"_blank\" style=\"text-decoration: underline\">Матрица на съседство</a>, <a href=\"/en/wiki/Help/IncidenceMatrix\" target=\"_blank\" style=\"text-decoration: underline\">Матрица на инцидентност</a>.";

    $g_lang["has_eulerian_path"]     = "Графът има Ойлеров път";
    $g_lang["has_not_eulerian_path"] = "Графът няма Ойлеров път";

    $g_lang["min_dist_matrix_description"] = "Матрица на минимални разстояния";
    
    $g_lang["graphOfMinDist"] = "Граф на минимални разстояния";
    $g_lang["checkToSave"]    = "Маркирайте за запазване";
    $g_lang["showDistMatrix"] = "Показване на матрица на разстояния";
    $g_lang["distMatrixText"] = "Матрица на разстояния";
    
    $g_lang["selectStartVertexForMaxFlow"]   = "Изберете източник на максималния поток";
    $g_lang["selectFinishVertexForMaxFlow"]  = "Изберете крайна точка на максималния поток";
    $g_lang["maxFlowResult"]  = "Максимален поток от %2 до %3 е равен на %1";
    $g_lang["flowNotExists"]  = "Поток от %1 в %2 не съществува";

    $g_lang["sourceVertex"]  = "Източник";
    $g_lang["sinkVertex"]    = "Крайна точка";

    $g_lang["export_graph"]    = "Експортирайте във файл";
    $g_lang["import_graph"]    = "Импортирайте от файл";

    $g_lang["has_hamiltonian_path"] = "Графът има път на Хамилтън";
    $g_lang["has_not_hamiltonian_path"] = "Графът няма път на Хамилтън";

    $g_lang["has_hamiltonian_loop"] = "Графът има цикъл на Хамилтън";
    $g_lang["has_not_hamiltonian_loop"] = "Графът няма цикъл на Хамилтън";

    $g_lang["start_traversal"]  = "Изберете начален връх за обход";
    $g_lang["traversal_order"]  = "Ред на обхода: ";

    $g_lang["curve_edge"]       = "Извиване на реброто";
    $g_lang["undo"]             = "Стъпка назад";

    $g_lang["opensource_message"] = "Нашият проект вече е с отворен код. Повече детайли...";

    $g_lang["settings"] = "Настройки";
    $g_lang["common_vertex_settings"]   = "Общи върхове";
    $g_lang["selected_vertex_settings"] = "Избрани върхове";
    $g_lang["common_edge_settings"]     = "Общи ребра";
    $g_lang["selected_edge_settings"]   = "Избрани ребра";

    $g_lang["common_color"] = "Общ цвят";
    $g_lang["stroke_color"] = "Цвят на щриха";
    $g_lang["stroke_size"]  = "Дебелина";
    $g_lang["text_color"]   = "Цвят на текста";
    $g_lang["save_graph"]   = "Запазете граф";
    $g_lang["default"]      = "По подразбиране";
    $g_lang["vertex_draw_style"] = "Стил на връх";
    $g_lang["text_background"]   = "Фон на текст";
    $g_lang["edge_draw_style"]   = "Стил на ребро";

    $g_lang["color"] = "Цвят";
    $g_lang["alpha"] = "Прозрачност";

    $g_lang["background_style"] = "Фон";

    $g_lang["adjacency_matrix_multigraph_description"] = "Мултиграф матрица съдържа теглото на минималните ребра между върховете.";

    $g_lang["graph_is_multi_message"]   = "Мултиграф не поддържа всички алгоритми";
    $g_lang["graph_is_general_message"] = "";

    $g_lang["replace_edge"] = "Заменете текущ";
    $g_lang["add_edge"] = "Добавете (мултиграф)";
    $g_lang["greek_add"] = "<a class=\"ProgresssBarLink\" href=\"/nl/\" target=\"_blank\">
We have added Dutch translation 🇳🇱. Thank you Willie de Wit</a>";
    $g_lang["text_above_edge"] = "Текст над ребро";

    $g_lang["select_groupe_mac"] = "Използвайте Cmd⌘ за да изберете няколко обекта.";
    $g_lang["select_groupe_win"] = "Използвайте Ctrl за да изберете няколко обекта.";
    $g_lang["drag_select_group"] = "Привлачете група.";
    $g_lang["copy_select_group"] = "Копирайте група";
    $g_lang["remove_select_group"] = "Изтрийте група";

    $g_lang["bfs_name"] = "Обхождане в ширина";
    $g_lang["coloring_name"] = "Оцветяване на граф";
    $g_lang["find_connection_component_name"] = "Намерете свързани компоненти";
    $g_lang["dfs_name"] = "Обхождане в дълбочина";
    $g_lang["eulerin_loop_name"] = "Намерете Ойлеров цикъл";
    $g_lang["eulerin_path_name"] = "Намерете Ойлеров път";
    $g_lang["fiold_name"] = "Алгоритъм на Флойд-Уаршал";
    $g_lang["graph_reorder_name"] = "Подредете графа";
    $g_lang["hamiltoian_cycle_name"] = "Намерете цикъл на Хамилтън";
    $g_lang["hamiltonian_path_name"] = "Намерете път на Хамилтън";
    $g_lang["max_flow_name"] = "Намерете максимален поток";
    $g_lang["minimum_spanning_tree"] = "Намерете минимално обхващащо дърво";
    $g_lang["modern_graph_style_name"] = "Визуализация на база тегло";
    $g_lang["radius_and_diameter_name"] = "Намерете радиус и диаметър на граф";
    $g_lang["find_short_path_name"] = "Намерете най-краткия път с помощта на алгоритъма на Дейкстра";
    $g_lang["vertices_degree_name"] = "Изчислете степента на връх";

    $g_lang["min_spanning_tree_res_is"] = "Теглото на минималното обхващащо дърво е ";
    $g_lang["min_spanning_tree_ignore_direction"] = "По време на калкулацията игнорирахме посоката на ребрата.";
    $g_lang["min_spanning_tree_graph_not_connected"] = "Графът не е свързан";

    // IsomorphismCheck.js
    $g_lang['select_first_graph_isomorphism_check'] = "Изберете първи граф за проверка за изоморфизъм. Щракнете на който и да е връх";
    $g_lang['select_second_graph_isomorphism_check'] = "Изберете втори граф за проверка за изоморфизъм. Щракнете на който и да е връх";
    $g_lang['select_first_graph_pattern_check'] = "Изберете шаблон на граф като щракнете на който и да е връх";
    $g_lang['select_second_graph_for_search_subgraph'] = "Изберете граф, в който да проверим за изоморфични подграфи. Щракнете на който и да е връх от този граф";
    $g_lang['graphs_isomorph'] = "Графите са изоморфични";
    $g_lang['graphs_not_isomorph'] = "Графите не са изоморфични";
    $g_lang['number_of_isomorph_subgraph_is'] = "Броят на изоморфични подграфи е ";
    $g_lang['graph_has_no_isomorph_subgraph'] = "Графът не съдържа изоморфични подграфи";
    $g_lang['search_isomorph_subgraph'] = "Търсене на изоморфични подграфи";
    $g_lang['subgraph_no'] = "Изоморфичen подграф # ";
    $g_lang['graph_has_no_atleast_2_graphs'] = "За да използвате алгоритъма, трябва да създадете 2 отделни графи";
    $g_lang['isomorphism_check'] = "Проверете за изоморфизъм в граф";

    // RadiusAndDiameter.js
    $g_lang['graph_is_disconnected'] = "Графът не е свързан";    
    $g_lang['graph_is_trivial'] = "Графът съдържа само един връх";
    $g_lang['graph_radius'] = "Градиус на граф";
    $g_lang['graph_diameter'] = "Диаметър на граф";
    $g_lang['vertex_central'] = "Централен връх";
    $g_lang['vertex_peripheral'] = "Периферен връх";

    // VerticesDegree.js
    $g_lang['maximum_degree_of_graph'] = "Максималната степен на графа е";

    // Coloring.js
    $g_lang['color_number'] = "Номерът на цвета е";

    $g_lang['done'] = "Готово";

    $g_lang['action'] = "Действия";
    $g_lang['common_edge_style'] = "Общ стил на ребро";
    $g_lang['selected_edge_style'] = "Избран стил на ребро";
    $g_lang['common_vertex_style'] = "Общ стил на връх";
    $g_lang['selected_vertex_style'] = "Избран стил на връх";

    $g_lang['shape'] = "Фигура";
    $g_lang['circle'] = "Кръг";
    $g_lang['squere'] = "Квадрат";
    $g_lang['triangle'] = "Триъгълник";
    $g_lang['pentagon'] = "Петоъгълник";
    $g_lang['textbox'] = "Textbox";
    $g_lang['vertex_diameter'] = "Големина на връх";         
    
    $g_lang['additional_text_color'] = "Друг цвят на текста"; 
    $g_lang['center'] = "Център";
    $g_lang['on_up'] = "Отгоре";

    $g_lang['weight_position'] = "Позиция на теглото";    
    $g_lang['text_position'] = "Позиция на текста";
    $g_lang['line_style']    = "Стил на реброто";
    $g_lang['edge_width']    = "Ширина на реброто";
    $g_lang['selected_index'] = "Селекция";    

    $g_lang['all'] = "Всички";    

    //FindAllPatches.js
    $g_lang['find_all_pathes'] = "Намерете всички пътища";
    $g_lang['number_of_pathes_from'] = "Брой на пътища от ";
    $g_lang['to'] = " до ";
    $g_lang['are'] = " са ";
    $g_lang['path_n'] = "Път #";
    $g_lang['selected_finish_vertex'] = "Изберете краен връх";
    $g_lang['selected_start_vertex'] = "Изберете начален връх";

    // FindShortPatchsFromOne.js
    $g_lang['find_all_paths_from_vertex'] = "Намерете всички най-кратки пътища от връх";
    $g_lang['distance_from'] = "Разстояние от ";
    $g_lang['path_to'] = "Път до ";

    $g_lang['search_pathes']    = "Search paths";
    $g_lang['other_algorithms'] = "Other algorithms";

    $g_lang['use_context_menu'] = "Use context menu for additional actions.";

    $g_lang['find_longest_path'] = "Find the longest path";
    $g_lang['length_of_longest_path_from'] = "Length of the longest path from "; 

    $g_lang['additionl_actions'] = "Special actions";
    $g_lang['reverse_all_edges'] = "Reverse all edges";
    $g_lang['make_all_undirected'] = "Make all edges undirected";
    $g_lang['make_all_directed'] = "Make all edges directed";    

    $g_lang['save_svg_image'] = "Save graph to SVG";  

    $g_lang["bad_inc_pair_message"] = "Cannot create graph. Edge list has wrong format. Click \"fix\" button to fix edge list or \"help\" button to open help about format";
    $g_lang["edge_list_wrong_format"] = "Edge list format is incorrect";
    $g_lang["fix_button"] = "fix";

    $g_lang["snowflake"] = "Snowflake";    

    $g_lang["save_edge_for_future"] = "Save edge to reuse in the future";    
    $g_lang["reuse_saved_edge"] = "Reuse saved edge";       

    $g_lang["remove_background_image"] = "Remove background image";
    $g_lang["upload"] = "Upload";
    $g_lang["background_image"] = "Background image";

    $g_lang['wrong_image_background_format'] = "Wrong image format. Only JPEG and PNG are supported";
    $g_lang['wrong_image_background_size'] = "Image size is too big. Image size must be less than {0} pixels.";    
?>
