<?php

    $g_lang["head_no_tags"] = "Онлайн Граф отворен код";
    $g_lang["text"] = "<p>Онлайн Граф е проект с отворен код. Може да намерите програмния код в github: <a href=\"https://github.com/UnickSoft/graphonline\">https://github.com/UnickSoft/graphonline</a>. Имаме планове за oще много функции, но нашия малък работен екип работи с бавно темпо.</p>\n\n<h2>Можете да ни помогнете</h2>\n\n<p>Ако занете езици за програмиране: php, JavaScript или C++, за да подобрите услугата на Онлайн Граф. Моля пишете ни в github или на <a href=\"mailto:admin@graphonline.ru\">admin@graphonline.ru</a>. Ако сте студент, това е добра възможност да работите в екип с разработчици.</p>\n\n<p>Също така можете да помогнете с обогатяването на нашето wiki: <a href=\"https://graphonline.ru/en/wiki/\">https://graphonline.ru/en/wiki/</a>. Или да подобрите дизайна. Или да изпробвате нова функционалност. Всеки случай, ако можете да посветите 1 час седмично на Онлайн Граф, пишете ни.</p>\n";

?>