<?php
    $g_lang["head"] = "Η σελίδα δεν βρέθηκε";
    $g_lang["message"] = "<p>Λυπούμαστε, αλλά η σελίδα δεν βρέθηκε στο διακομιστή.</p>\n\n
    <p>Ίσως, αυτές οι επιλογές να σας βοηθήσουν:</p>\n\n
    <ul>\n	
    <li>Μεταβείτε στην <a href=\"/\" title=\"Μετάβαση στην αρχική σελίδα\">αρχική σελίδα</a></li>\n	
    <li>Επιστροφή στην <a href=\"javascript:history.back()\" title=\"Μετάβαση στην προηγούμενη σελίδα\">προηγούμενη σελίδα</a></li>\n
    </ul>\n";

    $g_lang["m_title"] = "404 Η σελίδα δεν βρέθηκε";
?>