<?php

    $g_lang["head_no_tags"] = "Δημιουργία γραφήματος από πίνακα προσπτώσεων";
    $g_lang["text"] = "<p>Σε αυτήν τη σελίδα μπορείτε να εισαγάγετε τον πίνακα προσπτώσεων και να δημιουργήσετε την γραφική απεικόνιση του</p>\n";
    $g_lang["incidence_matrix_description"] = "Εισαγάγετε τον πίνακα προσπτώσεων. Χρησιμοποιήστε κόμμα \",\" ως διαχωριστικό και πατήστε \"Γραφική παράσταση\".";
    $g_lang["incidence_matrix_bad_format"] = "Ο πίνακας δεν είναι σωστός. Χρησιμοποιήστε κόμμα \",\" ως διαχωριστή. Ο πίνακας πρέπει να είναι τετράγωνος.";
    $g_lang["plot_graph_button"] = "Γραφική παράσταση";
    $g_lang["matrix_matrix_input"] = "Εισαγάγετε στον πίνακα";
    $g_lang["text_matrix_input"] = "Εισαγάγετε ως κείμενο";
    $g_lang["incidence_matrix_description_matrix"] = "Εισαγάγετε τον πίνακα προσπτώσεων. Πατήστε \"Γραφική παράσταση\" για να δείτε την γραφική παράσταση.";
    $g_lang["add_edge_to_matrix"] = "Προσθέστε ακμή";
    $g_lang["add_node_to_matrix"] = "Προσθέστε κορυφή";

    $g_lang["m_title"] = "Δημιουργία γραφήματος από πίνακα προσπτώσεων";
    $g_lang["m_keyWords"] = "graph online, γραφική παράσταση, δημιουργία γραφήματος από πίνακα προσπτώσεων, πίνακας προσπτώσεων";
    $g_lang["m_description"] = "Δημιουργείστε γράφημα από πίνακα προσπτώσεων online και δείτε το οπτικό αποτέλεσμα";

    $g_lang["separator"] = "Διαχωριστής: ";
    $g_lang["separator_commo"] = "κόμμα";
    $g_lang["separator_space"] = "κενό";
?>