<?php

    $g_lang["head_no_tags"] = "Πώς να δημιουργήσετε ένα γράφημα απο πίνακα γειτνίασης";
    $g_lang["text"] = "<p>Εάν δυσκολεύεστε να δημιουργήσετε ένα γράφημα χρησιμοποιώντας τον πίνακα γειτνίασης, 
    παρακολουθήστε το εκπαιδευτικό βίντεο</p>\n\n
    <p><iframe allowfullscreen=\"\" frameborder=\"0\" height=\"360\" src=\"//www.youtube.com/embed/2QeeGzgpy8A\" width=\"640\"></iframe></p>\n";

    $g_lang["m_title"] = "Δημιουργία γραφήματος απο πίνακα γειτνίασης";
    $g_lang["m_keyWords"] = "γράφημα, πίνακας γειτνίασης, γράφημα κατασκευής";
    $g_lang["m_description"] = "Δημιουργία γραφήματος χρησιμοποιώντας πίνακα γειτνίασης online";
?>
