<?php
    $g_lang["menu_0"] = "Αρχική";
    $g_lang["menu_1"] = "Δημιουργία γράφου";
    $g_lang["menu_2"] = "Βοήθεια";
    $g_lang["menu_3"] = "Επικοινωνία";
    $g_lang["menu_4"] = "Από πίνακα γειτνίασης";
    $g_lang["menu_5"] = "Από πίνακα προσπτώσεων";
    $g_lang["menu_6"] = "Wiki";
    $g_lang["menu_7"] = "Γρήγορη εκκίνηση";
    $g_lang["menu_8"] = "Νέα";
    $g_lang["menu_9"] = "Από παράδειγμα γράφων";
    $g_lang["menu_10"] = "Ανοιχτό λογισμικό";
    $g_lang["footer_info"] = "
    <a href=\"/en/\">Το Graph Online</a> 
    είναι ενα online πρότζεκτ με στόχο την εύκολη δημιουργία και απεικόνιση γράφων. 
    Δημιουργήσετε γραφήματα απο πίνακα γειτνίασης ή απο πίνακα προσπτώσεων. 
    Επίσης μπορείτε κάνετε αναζήτηση της συντομότερης διαδρομής και πλήθος άλλων αλγορίθμων. 
    <br>
    <a href=\"/el/about\">Σχετικά με το πρότζεκτ</a> και <a href=\"http://graph.unick-soft.ru/el/help\">σελίδα βοήθειας</a>.\n
    ";
    $g_lang["lang"] = "Γλώσσα";
    
?>