<?php

    $g_lang['m_title'] = '404 Сторінка не знайдена';
    $g_lang['head']    = 'Сторінка не знайдена';
    $g_lang['message'] = '<p>Вибачте, але ми не змогли знайти сторінку на нашому сервері.</p>
                          <p>Можливо вам допоможуть варіанти:</p>
                          <ul>
                              <li>Перейти на <a href="' . SiteRoot() . '" title="Почати з головної сторінки сайту">головну сторінку сайту</a></li>
                              <li>Повернутися на <a href="javascript:history.back()" title="Повернутися назад">попередню сторінку</a></li>
                          </ul>';
?>