<?php

    $g_lang['m_title'] = '500 Внутрішня помилка сервера';
    $g_lang['head']    = 'Сталася помилка';
    $g_lang['message'] = '<p>На жаль, стався збій у роботі сайту.</p>
                          <p>Можливо вам допоможуть варіанти:</p>
                          <ul>
                              <li>Перейти на <a href="' . SiteRoot() . '" title="Почати з головної сторінки сайту">головну сторінку сайту</a></li>
                              <li>Повернутися на <a href="javascript:history.back()" title="Повернутися назад">попередню сторінку</a></li>
                          </ul>';
?>
