<?php

    $g_lang["title_notg"] = "Робота з графами онлайн";
    $g_lang["text"] = "<p>Проект&nbsp;<a href=\"http://graph.unick-soft.ru\">Граф&nbsp;Онлайн</a> є&nbsp;наслідником програми для роботи з графами <a href=\"http://grafoanalizator.unick-soft.ru\">Графоаналізатор</a>. У нашому проекті ми&nbsp;спробуємо&nbsp;врахувати всі накопичені за&nbsp;багато&nbsp;років&nbsp;побажання користувачів&nbsp;програми.</p>\n\n<p>Наш сервіс дозволить вам працювати з графами&nbsp;безпосередньо у вікні вашого&nbsp;браузера. Вам необхідно&nbsp;перейти на&nbsp;головну сторінку&nbsp;сайту і ви&nbsp;можете почати будувати граф <a href=\"http://graph.unick-soft.ru\">http://graph.unick-soft.ru</a>.</p>\n\n<p>Проект&nbsp;надає користувачам&nbsp;вирішення 3х завдань при роботі з графами:&nbsp;</p>\n\n<ol>\n	<li>Побудова графа: візуально чи по матриці суміжності.</li>\n	<li>Візуалізація графа.</li>\n	<li>Розрахунок&nbsp;алгоритмів, наприклад пошук&nbsp;найкоротшого&nbsp;шляху.</li>\n</ol>\n\n<p><span style=\"background-color:rgb(255, 255, 255); font-size:15.1999998092651px\">Всі питання і пропозиції ви можете надсилати на адресу admin@unick-soft.ru або soft_support@list.ru</span></p>\n\n<p>&nbsp;</p>\n";

    $g_lang["m_title"] = "Граф онлайн - легкий інструмент для роботи з графами";
    $g_lang["m_keyWords"] = "граф, побудова графу, матриця суміжності, пошук найкоротшого шляху";
    $g_lang["m_description"] = "Про проект Граф Онлайн";
?>