<?php

    $g_lang["head_no_tags"] = "Побудова графа по матриці інцидентності";
    $g_lang["text"] = "<p>На даній сторінці ви можете задати матрицю інцидентності та побудувати по ній граф</p>\n";
    $g_lang["incidence_matrix_description"] = "Задайте матрицю інцидентності. Використовуйте кому \",\" у якості розділювача. Потім натисніть кнопку \"Побудувати граф\".";
    $g_lang["incidence_matrix_bad_format"] = "Матриця має неправильний формат. Використовуйте кому \",\" у якості розділювача.";
    $g_lang["plot_graph_button"] = "Побудувати граф";

    $g_lang["m_title"] = "Побудова графа по матриці інцидентності";
    $g_lang["m_keyWords"] = "матрица інцидентності, граф, створення графа, побудова графа онлайн, використовувати матрицю інцидентності";
    $g_lang["m_description"] = "Створення графа по матриці інцидентності онлайн";
    
    $g_lang["incidence_matrix_description_matrix"] = "Задайте матрицю інцидентності. Потім натисніть кнопку \"Побудувати граф\".";
    $g_lang["matrix_matrix_input"] = "Ввести в таблицю";
    $g_lang["text_matrix_input"] = "Ввести як текст";
    $g_lang["add_edge_to_matrix"] = "Додати дугу";
    $g_lang["add_node_to_matrix"] = "Додати вершину";
    
    $g_lang["use_ctrl_to_move_cells"] = "Використовуйте Ctrl + &#8592; &#8593; &#8594; &#8595; клавіші для переміщення між комірками.";
?>