<?php

    $g_lang["head_no_tags"] = "Як створити граф по матриці суміжності";
    $g_lang["text"] = "<p>Якщо у вас виникли складнощі зі створенням графу по матриці суміжності за допомогою нашого сервісу, то перегляньте навчальне відео</p>\n\n<p><iframe allowfullscreen=\"\" frameborder=\"0\" height=\"360\" src=\"//www.youtube.com/embed/2QeeGzgpy8A\" width=\"640\"></iframe></p>\n";

    $g_lang["m_title"] = "Допомога у створенні графа по матриці суміжності";
    $g_lang["m_keyWords"] = "граф, матриця суміжності, побудувати граф онлайн.";
    $g_lang["m_description"] = "Допомога у побудові графу по матриці суміжності онлайн";
?>
