<?php

    $g_lang['head_no_tags'] = 'Створення графа по списку ребер';
    $g_lang['text'] = '<p>На даній сторінці ви можете задати список ребер і побудувати по ньому граф.</p>';
    $g_lang['pair_description'] = 'Задайте список ребер, кожне ребро повинно бути на новому рядку і використовувати у якості розділювача між вершинами "<b>-</b>". Наприклад: <b>1-2</b>. <small>Читайте нижче про розширений формат.</small>';    
    $g_lang['plot_graph_button'] = 'Побудувати граф';
    $g_lang['pair_bad_format'] = 'Неправильний формат. Ребро повинно мати формат: вершина1-вершина2. <small>Читайте про розширений формат нижче.</small>';
    $g_lang['ex_pair_format'] = "Розширений формат";
    $g_lang['ex_pair_forma_description'] ="                            за допомогою розширеного формату можна задавати орієнтовані та зважені дуги. Різні варіанти використання:
        <ul>
            <li><b>a-b</b> - дуга між <b>a</b> і <b>b</b>.</li>                                
            <li><b>a>b</b> - орієнтована дуга з <b>a</b> в <b>b</b>.</li>
            <li><b>a&lt;b</b> - орієнтована дуга з <b>b</b> в <b>a</b>. </li>
            <li><b>a-(8)-b</b> - навантажена дуга між <b>a</b> і <b>b</b> з вагою <b>8</b>.</li>
            <li><b>a-(3.5)>b</b> - орієнтована дуга з <b>a</b> в <b>b</b> з вагою <b>3.5</b>.</li>
            <li><b>a<(1)-b</b> - орієнтована дуга з <b>b</b> в <b>a</b> з вагою <b>1</b>.</li>
        </ul>";
    $g_lang['edge_list'] = 'Список ребер';
?>