<?php
    $g_lang["title_notg"] = "Підтримати Граф Онлайн";
    $g_lang["text"] = "<p>Проект \"Граф Онлайн\" - безкоштовний навчальний ресурс оголошує про збір коштів для підтримки і розвитку проекту.</p>" .
        "<p>Сервіс у чомусь унікальний і його хочеться робити ще краще і корисніше. Якщо він дійсно допомагає вам вирішити поставлені завдання, то ви можете допомогти його розвивати, стати частиною нашої команди. Нам здається, що це найбільш правильна модель фінансування проекту, так як не хочется псувати навчальний ресурс розміщенням реклами або урізанням функціоналу на догоду платним підпискам. Якщо у вас є питання завжди пишіть на <a href=\"mailto:admin@graphonline.ru\">admin@graphonline.ru</a>.</p>";

    $g_lang["m_title"] = "Graph online - підтримати проект";
    $g_lang["m_keyWords"] = "граф, побудова графа, підтримати проект";
    $g_lang["m_description"] = "Граф Онлайн підтримати проект";
?>
