<?php

    $g_lang["title_notg"] = "Робота з графами онлайн";
    $g_lang["text"] = "<p>Візуалізація графа, пошук найкоротшого шляху&nbsp;і багато іншого. У розділі Посібник ви <a href=\"/help\">знайдете навчальні відео</a>.</p>\n";
    $g_lang["add_node"] = "Додати вершину";
    $g_lang["connect_nodes"] = "Зʼєднати вершини";
    $g_lang["delete"] = "Видалити";
    $g_lang["default"] = "Переміщення";
    $g_lang["short_path"] = "Знайти найкоротший шлях";
    $g_lang["save_direction_choose"] = "Зберегти тип дуги (направлена або ні)";
    $g_lang["edge_weight"] = "Вага дуги";
    $g_lang["save_weight_choose"] = "використати значення для наступних дуг";
    $g_lang["default_weight"] = "ненавантажений";
    $g_lang["browser_no_support"] = "Ваш браузер не підтримується. Спробуйте оновити ваш браузер до останньої версії.";
    $g_lang["select_and_move_objects"] = "Виділіть і переміщайте обʼєкти або переміщайте робочу область.";
    $g_lang["move_cursor_for_moving"] = "Переміщайте курсор для переміщення обʼєкту";
    $g_lang["add_graph"] = "Додати ребро";
    $g_lang["orint_edge"] = "Орієнтовану";
    $g_lang["not_orint_edge"] = "Неорієнтовану";
    $g_lang["show_adjacency_matrix"] = "Матриця суміжності";
    $g_lang["save"] = "Зберегти";
    $g_lang["cancel"] = "Відміна";
    $g_lang["adjacency_matrix_description"] = "Задайте матрицю суміжності. Використовуйте кому \",\" у якості розділювача";
    $g_lang["adjacency_matrix_bad_format"] = "Матриця має неправильний формат. Використовуйте кому \",\" у якості розділювача. Матриця повинна мати однакову кількість стовпців і рядків.";
    $g_lang["delete_all"] = "Видалити всі";
    $g_lang["click_to_add_vertex"] = "Натисніть на робочу область, щоб додати вершину. <span style=\"float:right;\">Нумерація вершин " .
    "<select id=\"enumVertexsText\">" .
    "</select></span>";
    $g_lang["select_first_vertext_to_connect"] = "Виділіть першу вершину для створення дуги";
    $g_lang["select_second_vertext_to_connect"] = "Виділіть другу вершину, яку хочете зʼєднати";
    $g_lang["select_start_short_path_vertex"] = "Виділіть вершину, із якої хочете знайти найкоротший шлях";
    $g_lang["select_finish_short_path_vertex"] = "Виділіть кінцеву вершину найкоротшого шляху";
    $g_lang["short_path_result"] = "Відстань між вершинами %d";
    $g_lang["path_not_exists"] = "Шляху не існує";
    $g_lang["select_object_to_delete"] = "Натисніть по обʼєкту, який хочете видалити";
    $g_lang["shortest_dist"] = "Мін. відстань = ";
    $g_lang["show_incidence_matrix"] = "Матриця інцидентності";
    $g_lang["incidence_matrix_description"] = "Задайте матрицю інцидентності. Використовуйте кому \",\" у якості розділювача";
    $g_lang["incidence_matrix_bad_format"] = "Матриця має неправильний формат. Використовуйте кому \",\" у якості розділювача.";
    $g_lang["this_is_graph_link"] = "Граф збережений і буде доступний за посиланням:";
    $g_lang["share_graph_text"] = "Граф Онлайн: Збережений граф";
    $g_lang["share_graph_description"] = "Опублікувати посилання у соціальних мережах:";
    $g_lang["graph"] = "Граф";
    $g_lang["save_dialog_title"] = "Збереження графа";
    $g_lang["close_button"] = "закрити";
    $g_lang["connected_component"] = "Знайти компоненти звʼязності";
    $g_lang["sick_connected_component_result"] = "Число слабко звʼязних компонентів рівно ";
    $g_lang["connected_component_result"] = "Число компонентів звʼязності графа рівно ";
    $g_lang["new_graph"] = "Створити граф";
    $g_lang["what_do_you_think"] = "Що ви думаете про сайт?";
    $g_lang["name"] = "Імʼя (email для відповіді)";
    $g_lang["feedback"] = "Написати";
    $g_lang["send"] = "Відправити";
    $g_lang["write_to_us"] = "Напишіть нам";
    $g_lang["fix_matrix_button"] = "виправити матрицю";
    $g_lang["open_matrix_help"] = "посібник";
    $g_lang["wrong_matrix_title"] = "Матриця має неправильний формат";
    $g_lang["bad_adj_matrix_message"] = "Помилка створення графа. Матриця суміжності має неправильний формат. Натисніть кнопку \"виправити матрицю\" щоб виправити матрицю або кнопку \"посібник\" щоб відкрити посібник про формат матриці";
    $g_lang["bad_inc_matrix_message"] = "Помилка створення графа. Матриця інцидентності має неправильний формат. Натисніть кнопку \"виправити матрицю\" щоб виправити матрицю або кнопку \"посібник\" щоб відкрити посібник про формат матриці";
    $g_lang["save_image"] = "Знімок робочої області";
    $g_lang["save_full_image"] = "Зберегти зображення графа";
    $g_lang["save_print_image"] = "Зображення графа для друку (ч\б)";
    $g_lang["open_saved_image_browser"] = "Відкрити зображення у браузері";
    $g_lang["download_saved_image"] = "Скачати збережене зображення";
    $g_lang["save_image_dialog_title"] = "Збереження зображення графа";
    $g_lang["full_report"] = "Повний звіт";
    $g_lang["short_report"] = "Короткий звіт";
    $g_lang["find_eulerian_loop"] = "Знайти Ейлерів цикл";
    $g_lang["has_eulerian_loop"] = "Граф містить Ейлерів цикл";
    $g_lang["has_not_eulerian_loop"] = "Граф не містить Ейлерів цикл";
    $g_lang["algorithms"] = "Алгоритми";
    $g_lang["processing"] = "Обробка...";

    $g_lang["m_title"] = "Інструмент для роботи з графами онлайн";
    $g_lang["m_keyWords"] = "графи, пошук найкоротшого шляху, візуалізація графа, матриця суміжності, пошук компонети звʼязності, пошук Ейлерового циклу, пошук мінімального остовного дерева, побудова графа по матриці";
    $g_lang["m_description"] = "Побудова графа по матриці або візуально і розрахунок різноманітних алгоритмів: пошук мінімального шляху, пошук мінімального остовного дерева та інших.";
    $g_lang["view"] = "Вигляд";
    $g_lang["view_keys"] = "Для позиціонування використовуйте клавіші \"ц\", \"ф\", \"і\", \"в\" або \"w\", \"a\", \"s\", \"d\".";
    $g_lang["zoom_fit"] = "По розміру графа";
    $g_lang["zoom_in"]   = "Збільшити";
    $g_lang["zoom_out"]  = "Зменшити";

    $g_lang["move_workspace"]  = "Переміщати робочу область";


    $g_lang["custom"]  = "Текст";
    $g_lang["enter_vertex_title"]  = "Введіть текст";
    
    $g_lang["rename_vertex"] = "Перейменувати вершину";
    $g_lang["rename_text"]   = "Перейменувати";
    
    $g_lang["current_language"] = "ua";
    

    $g_lang["developer_tools_title"] = "Створення алгоритмів";
    $g_lang["developer_tools_text"] = "Вставте ваш алгоритм нижче і натисність \"Виконати\"";
    $g_lang["developer_tools_run"] = "Виконати";
    $g_lang["developer_tools_submit"] = "Додати на сайт";
    
    $g_lang["algorithm_was_sent"] = "Алгоритм відправлений";
    $g_lang["your_algorithm_was_sent"] = "Ваш алгоритм відправлений на модерацію і у випадку успіху він буде доданий на сайт.";
    
    $g_lang["edit_weight"] = "Змінити вагу";
    
    $g_lang["group_rename"] = "Групове перейменування";
    $g_lang["enter_vertices_text_in_each_line"] = "Введіть текст для кожної вершини у окремий рядок";
    $g_lang["or"] = "або";
    $g_lang["vote"] = "Опитування";
    $g_lang["vote_question"] = "Які функції нам додати у першу чергу?";
    $g_lang["what_algorithm_need"] = "Будь ласка, напишіть, якого алгоритму вам не вистачає. <a href=\"/donate\" style=\"text-decoration: underline\" target=\"_blank\">Підтримувати проект</a>.";

    $g_lang["recommend_algorithm"] = "Рекомендувати алгоритми";

    $g_lang["what_algorithm_we_have"] = "Сервіс уже підтримує наступний функціонал: <a href=\"/wiki/Посібник/ПошукНайкоротшогоШляху\" target=\"_blank\" style=\"text-decoration: underline\">Пошук шляху алгоритмом Дейкстри</a>, <a href=\"/wiki/Посібник/МатрицаСуміжності\" target=\"_blank\" style=\"text-decoration: underline\">матрицю суміжності</a>, <a href=\"/wiki/Посібник/МатрицаІнцидентності\" target=\"_blank\" style=\"text-decoration: underline\">матрицю інцидентності</a>.";

    $g_lang["has_eulerian_path"] = "Граф містить Ейлеровий ланцюг";
    $g_lang["has_not_eulerian_path"] = "Граф не містить Ейлеровий ланцюг";

    $g_lang["min_dist_matrix_description"] = "Матриця мінімальних відстаней графа";
    
    $g_lang["graphOfMinDist"] = "Граф мінімальних відстаней.";
    $g_lang["checkToSave"]    = "Натисніть для збереження";
    $g_lang["showDistMatrix"] = "Показати матрицю відстаней";
    $g_lang["distMatrixText"] = "Матриця відстаней";

    $g_lang["selectStartVertexForMaxFlow"]   = "Виділіть витік максимального потоку";
    $g_lang["selectFinishVertexForMaxFlow"]  = "Виділіть стік максимального потоку";
    $g_lang["maxFlowResult"]  = "Максимальний потік із %2 у %3 рівний %1";
    $g_lang["flowNotExists"]  = "Потік із %1 у %2 не існує";

    $g_lang["sourceVertex"]  = "Витік";
    $g_lang["sinkVertex"]    = "Стік";

    $g_lang["export_graph"]    = "Експортувати граф";
    $g_lang["import_graph"]    = "Імпортувати граф";

    $g_lang["has_hamiltonian_path"] = "Граф містить Гамільтоновий ланцюг";
    $g_lang["has_not_hamiltonian_path"] = "Граф не містить Гамільтоновий ланцюг";

    $g_lang["has_hamiltonian_loop"] = "Граф містить Гамільтонів цикл";
    $g_lang["has_not_hamiltonian_loop"] = "Граф не містить Гамільтонів цикл";

    $g_lang["start_traversal"]  = "Оберіть початкову вершину обходу";
    $g_lang["traversal_order"]  = "Порядок обходу: ";

    $g_lang["curve_edge"]       = "Вигин дуги";
    $g_lang["undo"]             = "Відмінити";

    $g_lang["opensource_message"] = "Наш проект став проектом з відкритим вихідним кодом. Детальніше...";

    $g_lang["we_are_improving"] = "Ми покращуємо Graphonline, якщо ви зіштовхнулись з проблемами напишіть нам: admin@graphonline.ru";

    $g_lang["settings"] = "Налаштування";
    $g_lang["common_vertex_settings"]   = "Звичайних вершин";
    $g_lang["selected_vertex_settings"] = "Виділених вершин";
    $g_lang["common_edge_settings"]     = "Звичайних дуг";
    $g_lang["selected_edge_settings"]   = "Виділених дуг";

    $g_lang["common_color"] = "Основний колір";
    $g_lang["stroke_color"] = "Колір обводки";
    $g_lang["stroke_size"]  = "Товщина обводки";
    $g_lang["text_color"]   = "Колір тексту";
    $g_lang["save_graph"]   = "Зберегти граф";
    $g_lang["default"]      = "По замовчуванню";
    $g_lang["vertex_draw_style"] = "Стиль малювання вершини";
    $g_lang["text_background"]   = "Фон тексту";
    $g_lang["edge_draw_style"]   = "Стиль малювання дуги";

    $g_lang["color"] = "Колір";
    $g_lang["alpha"] = "Прозорість";

    $g_lang["background_style"] = "Фону";

    $g_lang["adjacency_matrix_multigraph_description"] = "Для мультиграфу матриця містить значения мінімальних дуг між вершинами.";

    $g_lang["replace_edge"] = "замінити поточну";
    $g_lang["add_edge"] = "додати (мультиграф)";

    $g_lang["graph_is_multi_message"]   = "Мультиграф не підтримує всі алгоритми";
    $g_lang["graph_is_general_message"] = "";
    $g_lang["text_above_edge"] = "Текст над дугою";

    $g_lang["select_groupe_mac"] = "Виділіть декілька обʼєктів використовуючи Cmd⌘.";
    $g_lang["select_groupe_win"] = "Виділіть декілька обʼєктів використовуючи Ctrl.";
    $g_lang["drag_select_group"] = "Переміщайте групу.";
    $g_lang["copy_select_group"] = "Копіювати";
    $g_lang["remove_select_group"] = "Видалити";

    $g_lang["bfs_name"] = "Пошук у ширину";
    $g_lang["coloring_name"] = "Розфарбування графу";
    $g_lang["find_connection_component_name"] = "Знайти компоненти звʼязності";
    $g_lang["dfs_name"] = "Пошук у глибину";
    $g_lang["eulerin_loop_name"] = "Знайти Ейлерів цикл";
    $g_lang["eulerin_path_name"] = "Знайти Ейлеровий ланцюг";
    $g_lang["fiold_name"] = "Алгоритм Флойда — Уоршелла";
    $g_lang["graph_reorder_name"] = "Впорядкувати граф";
    $g_lang["hamiltoian_cycle_name"] = "Знайти Гамільтонів цикл";
    $g_lang["hamiltonian_path_name"] = "Знайти Гамільтонів ланцюг";
    $g_lang["max_flow_name"] = "Пошук максимального потоку";
    $g_lang["minimum_spanning_tree"] = "Пошук мінімального остовного дерева";
    $g_lang["modern_graph_style_name"] = "Візуалізація на основі ваг";
    $g_lang["radius_and_diameter_name"] = "Пошук радіусу і діаметру графа";
    $g_lang["find_short_path_name"] = "Пошук найкоротшого шляху алгоритмом Дейкстри";
    $g_lang["find_short_path_belman_ford_name"] = "Пошук найкоротшого шляху алгоритмом Беллмана-Форда";

    $g_lang["vertices_degree_name"] = "Розрахувати степінь вершин";

    $g_lang["min_spanning_tree_res_is"] = "Вага мінімального остовного дерева рівна ";
    $g_lang["min_spanning_tree_ignore_direction"] = "Ми ігнорували орієнтацію дуг при розрахунку.";
    $g_lang["min_spanning_tree_graph_not_connected"] = "Граф не є звʼязним";

    // IsomorphismCheck.js
    $g_lang['select_first_graph_isomorphism_check'] = "Виділіть перший граф для перевірки на ізоморфізм. Натисніть по будь-якій вершині графа";
    $g_lang['select_second_graph_isomorphism_check'] = "Виділіть другий граф для перевірки на ізоморфізм. Натисніть по будь-якій вершині графа";
    $g_lang['select_first_graph_pattern_check'] = "Виділіть граф, якому повинні бути ізоморфні підграфи. Натисніть по будь-якій вершині графа";
    $g_lang['select_second_graph_for_search_subgraph'] = "Виділіть граф у якому необхідно знайти ізоморфні підграфи. Натисніть по будь-якій вершині графа";
    $g_lang['graphs_isomorph'] = "Графи ізоморфні";
    $g_lang['graphs_not_isomorph'] = "Графи не ізоморфні";
    $g_lang['number_of_isomorph_subgraph_is'] = "Кількість ізоморфних підграфів рівна ";
    $g_lang['graph_has_no_isomorph_subgraph'] = "Граф не містить ізоморфних підграфів";
    $g_lang['search_isomorph_subgraph'] = "Пошук ізоморфних підграфів";
    $g_lang['subgraph_no'] = "Ізоморфний підграф № ";
    $g_lang['graph_has_no_atleast_2_graphs'] = "Для використання алгоритму необхідно створити хоча б 2 не звʼязних графа";
    $g_lang['isomorphism_check'] = "Перевірка ізоморфності графів<sub>beta</sup>";

    // RadiusAndDiameter.js
    $g_lang['graph_is_disconnected'] = "Граф не є звʼязним";
    $g_lang['graph_is_trivial'] = "Граф містить тільки одну вершину";
    $g_lang['graph_radius'] = "Радіус графа";
    $g_lang['graph_diameter'] = "Діаметр графа";
    $g_lang['vertex_central'] = "Центральна";
    $g_lang['vertex_peripheral'] = "Периферійна";

    // VerticesDegree.js
    $g_lang['maximum_degree_of_graph'] = "Максимальна степінь вершин графа рівна";

    // Coloring.js
    $g_lang['color_number'] = "Знайдена кількість кольорів";

    $g_lang['done'] = "Готово";

    $g_lang['action'] = "Дії";
    $g_lang['common_edge_style'] = "Стиль звичайної дуги";
    $g_lang['selected_edge_style'] = "Стиль виділеної дуги";
    $g_lang['common_vertex_style'] = "Стиль звичайної вершини";
    $g_lang['selected_vertex_style'] = "Стиль виділеної вершини";

    $g_lang['shape'] = "Форма";
    $g_lang['circle'] = "Круг";
    $g_lang['squere'] = "Квадрат";
    $g_lang['triangle'] = "Трикутник";
    $g_lang['pentagon'] = "Пʼятикутник";
    $g_lang['textbox'] = "Текстове поле";
    $g_lang['vertex_diameter'] = "Розмір вершини";

    $g_lang['additional_text_color'] = "Колір іншого тексту"; 
    $g_lang['center'] = "По центру";
    $g_lang['on_up'] = "Зверху";

    $g_lang['weight_position'] = "Позиція ваги";    
    $g_lang['text_position'] = "Позиція тексту";
    $g_lang['line_style']    = "Стиль дуги";
    $g_lang['edge_width']    = "Товщина дуги";
    $g_lang['selected_index'] = "Група виділення";    

    $g_lang['all'] = "Всі";

    //FindAllPatches.js
    $g_lang['find_all_pathes'] = "Пошук всіх шляхів";
    $g_lang['number_of_pathes_from'] = "Кількість шляхів із ";
    $g_lang['to'] = " у ";
    $g_lang['are'] = " рівно ";
    $g_lang['path_n'] = "Шлях №";
    $g_lang['selected_finish_vertex'] = "Виділіть кінцеву вершину";
    $g_lang['selected_start_vertex'] = "Виділіть початкову вершину";

    // FindShortPatchsFromOne.js
    $g_lang['find_all_paths_from_vertex'] = "Знайти всі найкоротші шляхи від вершини";
    $g_lang['distance_from'] = "Відстань від ";
    $g_lang['path_to'] = "Шлях до ";

    $g_lang['search_pathes']    = "Пошук шляхів";
    $g_lang['other_algorithms'] = "Інші алгоритми";

    $g_lang['use_context_menu'] = "Використовуйте контекстне меню для додаткових дій.";

    $g_lang['find_longest_path'] = "Пошук найдовшого шляху";
    $g_lang['length_of_longest_path_from'] = "Довжина найдовшого шляху рівна ";


    $g_lang['additionl_actions'] = "Особливі дії";
    $g_lang['reverse_all_edges'] = "Змінити напрямок всіх дуг";
    $g_lang['make_all_undirected'] = "Зробити всі дуги неорієнтованими";
    $g_lang['make_all_directed'] = "Зробити всі дуги орієнтованими";  

    $g_lang['save_svg_image'] = "Зберегти граф у SVG";  

    $g_lang["bad_inc_pair_message"] = "Помилка створення графа. Список ребер має неправильний формат. Натисніть кнопку \"виправити\" щоб виправити список або кнопку \"посібник\" щоб відкрити посібник про формат";
    $g_lang["edge_list_wrong_format"] = "Неправильний формат списку ребер";
    $g_lang["fix_button"] = "виправити";

    $g_lang["snowflake"] = "Сніжинка";

    $g_lang["save_edge_for_future"] = "Зберегти дугу для повторного використання";    
    $g_lang["reuse_saved_edge"] = "Використовувати збережену дугу";

    $g_lang["max_clique"] = "Максимальна кліка";
    $g_lang["max_clique_not_found"] = "Максимальна кліка не знайдена";
    $g_lang["max_clique_size_is"] = "Розмір Максимальної кліки рівний ";
    $g_lang["max_clique_contains"] = ". Кліка містить наступні вершини: ";

    $g_lang["remove_background_image"] = "Видалити фонове зображення";
    $g_lang["upload"] = "Завантажити";
    $g_lang["background_image"] = "Фонове зображення";

    $g_lang['wrong_image_background_format'] = "Неправильний формат зображення. Тільки JPEG і PNG підтримуються";
    $g_lang['wrong_image_background_size'] = "Розмір зображення занадто великий. Розмір зображення повинен бути менше {0} пікселів.";    

    $g_lang['text_size'] = "Розмір тексту";

    $g_lang['you_have_autosave'] = "Знайдено автозбереження для цього графа.";
    $g_lang['load_oiginal_or_autosaved'] = "Ви хочете завантажити оригінальний граф або автозбереження?";
    $g_lang['use_mouse_for_moving'] = "Використовуйте 🖱️ для переміщення";
    $g_lang['original_graph'] = "Оригінальний граф";
    $g_lang['autosaved_graph'] = "Автозбереження графа";

    $g_lang['open_last_used_graph'] = "Відкрити нещодавній граф";

    $g_lang['vertex_name_place_holder'] = "вершина";

    $g_lang["max_independent_set"] = "Максимальна незалежна множина";
    $g_lang["max_independent_set_not_found"] = "Максимальна незалежна множина не знайдена";
    $g_lang["max_independent_set_size_is"] = "Розмір Максимальної незалежної множини рівний ";
    $g_lang["max_independent_set_contains"] = ". Множина містить наступні вершини: ";

    $g_lang['find_all_shortest_pathes'] = "Знайти всі найкоротші шляхі між вершинами";
    $g_lang['number_of_shortest_pathes_from'] = "Кількість найкоротших шляхів з ";
    $g_lang['length_is'] = "довжина рівна ";

    $g_lang['graph_is_to_large'] = "Граф занадто великий для цього алгоритму (<span id=\"current_graph_size\">X</span> вершин, <span id=\"current_edge_number\">X</span> дуг).";
    $g_lang['algorith_supports_max_limit'] = "Алгоритм підтримує графи розмером не більше <span id=\"algorithm_max_limit\">X</span> вершин і <span id=\"algorithm_edge_limit\">X</span> дуг.";
    $g_lang['error'] = "Помилка";

    $g_lang['salesman_problem'] = "Задача комівояжера";
    $g_lang['no_solution'] = "Рішення не існує";
    $g_lang['shortest_loop_is'] = "Найкоротший цикл має довжину ";
    $g_lang['salesman_path_problem'] = "Задача комівояжера для шляху";
    $g_lang['shortest_path_is'] = "Найкоротший шлях має довжину ";
?>
