<?php

    /**
     * Главный языковой файл для русской версии сайта, грузится всегда и при этом первым.
     * Любую из этих переменных можно переопределить в lang файле текущей страницы.
     * Если $g_lang['m_title'] для текущей страницы не задан, то движок попытается найти на странице тег h1 и поставить в $g_lang['m_title'] его содержимое.
     *
     * @author Zmi и Guul
     */


    $g_lang['m_title']        = 'Graph Online'; // Заголовок страницы по умолчанию, который обычно пишется на вкладке открытой страницы.
    $g_lang['m_description']  = ''; // Description страницы по умолчанию.
    $g_lang['m_keyWords']     = ''; // Keywords страницы по умолчанию.
    $g_lang['m_titlePostfix'] = ''; // То, что дописывается после $g_lang['m_title']. Например " :: MySite.com".
?>
