<?php

    $g_lang["head_no_tags"] = "Построение графа по матрице смежности";
    $g_lang["text"] = "<p>На этой странице вы можете задать матрицу смежности&nbsp;и построить по ней граф&nbsp;</p>\n";
    $g_lang["adjacency_matrix_description"] = "Задайте матрицу смежности. Используйте запятую \",\" в качестве разделителя. Затем нажнимте кнопку \"Построить граф\"";
    $g_lang["adjacency_matrix_bad_format"] = "Мартрица имеет неправильный формат. Используйте запятую \",\" в качестве разделителя. Матрица должна иметь одинаковое количество столбцов и строк";

    $g_lang["m_title"] = "Построение графа по матрице смежности";
    $g_lang["m_keyWords"] = "матрица смежности, граф, создание графа";
    $g_lang["m_description"] = "Создание графа по матрице смежности";
?>